[net]

#batch=1
#subdivisions=1

batch=64
subdivisions=8

width=208
height=208
channels=3

#### Regularization ###
#momentum=.0
#decay=.0
#saturation = 1.
#exposure = 1.
#hue=1.

momentum=0.9
decay=0.0005
saturation = 1.5
exposure = 1.5
hue=.1
#######################

angle=0

learning_rate=0.001
max_batches = 500000
policy=steps

steps=-1,100,400000,450000
scales=.1,10,.1,.1

[convolutional]
batch_normalize=1
filters=32
size=3
stride=2
pad=1
activation=leaky

#[maxpool]
#size=2
#stride=2

[convolutional]
batch_normalize=1
filters=64
size=3
stride=2
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

#[maxpool]
#size=2
#stride=2

[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=32
size=1
stride=1
pad=0
activation=leaky

[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=32
size=1
stride=1
pad=0
activation=leaky

[convolutional]
batch_normalize=1
filters=64
size=3
stride=2
pad=1
activation=leaky

#[maxpool]
#size=2
#stride=2

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=64
size=1
stride=1
pad=0
activation=leaky

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=64
size=1
stride=1
pad=0
activation=leaky

[convolutional]
batch_normalize=1
filters=128
size=3
stride=2
pad=1
activation=leaky


#[maxpool]
#size=2
#stride=2

[convolutional]
batch_normalize=1
filters=512
size=3
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=0
activation=leaky

[convolutional]
batch_normalize=1
filters=512
size=3
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=0
activation=leaky

[convolutional]
batch_normalize=1
filters=512
size=3
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=0
activation=leaky

[convolutional]
batch_normalize=1
filters=512
size=3
stride=1
pad=1
activation=leaky

###########

[convolutional]
size=1
stride=1
pad=1
filters=75
activation=linear

[region]
#anchors = 0.738768,0.874946,  2.42204,2.65704,  4.30971,7.04493,  10.246,4.59428,  12.6868,11.8741
#anchors = 0.5374,1.0886, 1.7320,3.6166, 9.7808,10.4734, 4.4838,10.4687, 3.1426,6.7518
anchors = 9.3327,16.4455, 29.0538,53.2749, 52.7579,101.2759, 69.4372,164.6676, 155.5741,164.0410
bias_match=1
classes=10
coords=4
num=5
softmax=1

#### Regularization ####
#jitter=.05
#rescore=0

jitter=.2
rescore=1
#######################

object_scale=5
noobject_scale=1
class_scale=1
coord_scale=1

absolute=1
thresh = .6
random=1
